Dlubal.RFEM5.AnalysisMethodType
Type of analysis method.

Dlubal.RFEM5.AnalysisMethodType.UnknownAnalysis
Unknown analysis method.

Dlubal.RFEM5.AnalysisMethodType.GeometricallyLinearStatic
Geometrically linear static analysis

Dlubal.RFEM5.AnalysisMethodType.SecondOrder
Second-order analysis (P-Delta)

Dlubal.RFEM5.AnalysisMethodType.LargeDeformation
Large deformation analysis

Dlubal.RFEM5.AnalysisMethodType.Postcritical
Postcritical analysis